/*
Комментарии бывают хорошими и плохими.

Плохой коммент тот, который просто описывает, что делвает код. Это лишнее.
Если код слишком непонятный - его стоит разбить на функции, чтобы повысить читабельность.

Хорошие комментарии описывают неочевидные вещи:
    архитектуру приложения,
    неочевидный выбор некоторого решения/алгоритма
    остальные тонкости и неочевидности
*/

/*
А также важно избегать ниндзя-кода.
Скорее всего, ваш код будут читать другие!

Сжато, но не понятно - такое не допустимо.
Пусть больше кода, но она разборчивый.

Названия переменных и функций однозначно говорят, что
именно они делают или содержат.

Избегать абстрактных названий - так проще искать переменные.
И понимать, что они содержат.

Писать только на кириллице и без ромадзи. Только англ слова!
Ты переменные на азиатском языке не сможешь понять.

Избегать синонимов - они ведут к путанице.

Не использовать имена повторно.

Не перекрывать локальные функции глобальными.

Каждая функция решает 1 конкретную задачу.
*/