/*
У JS есть свои правила написания кода. При этом, они сугубо
    предпочтительные, но никак не обязательные.

Основные моменты:
    минимизировать количество однострочных условий if, циклов и функций;
    при очень длинной строке символы переносить на новую строку;
    всегда соблюдать отступы;
    всегда ставить ; несмотря на то, что чаще всего это не вызовет
        недопонимания с последующими исключениями;
    минимизация уровней вложенности;
    функции размещать после основной программы.
*/